arendst/Tasmota/arduino/version 2.4.0/boards.txt
##############################################################
espresso_lite_v2.name=ESPresso Lite 2.0
espresso_lite_v2.build.board=ESP8266_ESPRESSO_LITE_V2
espresso_lite_v2.build.variant=espresso_lite_v2
espresso_lite_v2.upload.tool=esptool
espresso_lite_v2.upload.maximum_data_size=81920
espresso_lite_v2.upload.wait_for_upload_port=true
espresso_lite_v2.serial.disableDTR=true
espresso_lite_v2.serial.disableRTS=true
espresso_lite_v2.build.mcu=esp8266
espresso_lite_v2.build.core=esp8266
espresso_lite_v2.build.spiffs_pagesize=256
espresso_lite_v2.build.debug_port=
espresso_lite_v2.build.debug_level=
espresso_lite_v2.menu.CpuFrequency.80=80 MHz
espresso_lite_v2.menu.CpuFrequency.80.build.f_cpu=80000000L
espresso_lite_v2.menu.CpuFrequency.160=160 MHz
espresso_lite_v2.menu.CpuFrequency.160.build.f_cpu=160000000L
espresso_lite_v2.build.flash_mode=dio
espresso_lite_v2.build.flash_freq=40
espresso_lite_v2.menu.FlashSize.4M1M=4M (1M SPIFFS)
espresso_lite_v2.menu.FlashSize.4M1M.build.flash_size=4M
espresso_lite_v2.menu.FlashSize.4M1M.build.flash_ld=eagle.flash.4m1m.ld
espresso_lite_v2.menu.FlashSize.4M1M.build.spiffs_pagesize=256
espresso_lite_v2.menu.FlashSize.4M1M.upload.maximum_size=1044464
espresso_lite_v2.menu.FlashSize.4M1M.build.spiffs_start=0x300000
espresso_lite_v2.menu.FlashSize.4M1M.build.spiffs_end=0x3FB000
espresso_lite_v2.menu.FlashSize.4M1M.build.spiffs_blocksize=8192
espresso_lite_v2.menu.FlashSize.4M3M=4M (3M SPIFFS)
espresso_lite_v2.menu.FlashSize.4M3M.build.flash_size=4M
espresso_lite_v2.menu.FlashSize.4M3M.build.flash_ld=eagle.flash.4m.ld
espresso_lite_v2.menu.FlashSize.4M3M.build.spiffs_pagesize=256
espresso_lite_v2.menu.FlashSize.4M3M.upload.maximum_size=1044464
espresso_lite_v2.menu.FlashSize.4M3M.build.spiffs_start=0x100000
espresso_lite_v2.menu.FlashSize.4M3M.build.spiffs_end=0x3FB000
espresso_lite_v2.menu.FlashSize.4M3M.build.spiffs_blocksize=8192
espresso_lite_v2.menu.ResetMethod.ck=ck
espresso_lite_v2.menu.ResetMethod.ck.upload.resetmethod=ck
espresso_lite_v2.menu.ResetMethod.nodemcu=nodemcu
espresso_lite_v2.menu.ResetMethod.nodemcu.upload.resetmethod=nodemcu
espresso_lite_v2.menu.LwIPVariant.v2mss536=v2 Prebuilt (MSS=536)
espresso_lite_v2.menu.LwIPVariant.v2mss536.build.lwip_include=lwip2/include
espresso_lite_v2.menu.LwIPVariant.v2mss536.build.lwip_lib=-llwip2
espresso_lite_v2.menu.LwIPVariant.v2mss536.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536
espresso_lite_v2.menu.LwIPVariant.v2mss1460=v2 Prebuilt (MSS=1460, unstable)
espresso_lite_v2.menu.LwIPVariant.v2mss1460.build.lwip_include=lwip2/include
espresso_lite_v2.menu.LwIPVariant.v2mss1460.build.lwip_lib=-llwip2_1460
espresso_lite_v2.menu.LwIPVariant.v2mss1460.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460
espresso_lite_v2.menu.LwIPVariant.Prebuilt=v1.4 Prebuilt
espresso_lite_v2.menu.LwIPVariant.Prebuilt.build.lwip_lib=-llwip_gcc
espresso_lite_v2.menu.LwIPVariant.Prebuilt.build.lwip_flags=-DLWIP_OPEN_SRC
espresso_lite_v2.menu.LwIPVariant.OpenSource=v1.4 Open Source
espresso_lite_v2.menu.LwIPVariant.OpenSource.build.lwip_lib=-llwip_src
espresso_lite_v2.menu.LwIPVariant.OpenSource.build.lwip_flags=-DLWIP_OPEN_SRC
espresso_lite_v2.menu.LwIPVariant.OpenSource.recipe.hooks.sketch.prebuild.1.pattern=make -C "{runtime.platform.path}/tools/sdk/lwip/src" install TOOLS_PATH="{runtime.tools.xtensa-lx106-elf-gcc.path}/bin/xtensa-lx106-elf-"
espresso_lite_v2.menu.Debug.Disabled=Disabled
espresso_lite_v2.menu.Debug.Disabled.build.debug_port=
espresso_lite_v2.menu.Debug.Serial=Serial
espresso_lite_v2.menu.Debug.Serial.build.debug_port=-DDEBUG_ESP_PORT=Serial
espresso_lite_v2.menu.Debug.Serial1=Serial1
espresso_lite_v2.menu.Debug.Serial1.build.debug_port=-DDEBUG_ESP_PORT=Serial1
espresso_lite_v2.menu.DebugLevel.None____=None
espresso_lite_v2.menu.DebugLevel.None____.build.debug_level=
espresso_lite_v2.menu.DebugLevel.SSL=SSL
espresso_lite_v2.menu.DebugLevel.SSL.build.debug_level= -DDEBUG_ESP_SSL
espresso_lite_v2.menu.DebugLevel.TLS_MEM=TLS_MEM
espresso_lite_v2.menu.DebugLevel.TLS_MEM.build.debug_level= -DDEBUG_ESP_TLS_MEM
espresso_lite_v2.menu.DebugLevel.HTTP_CLIENT=HTTP_CLIENT
espresso_lite_v2.menu.DebugLevel.HTTP_CLIENT.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT
espresso_lite_v2.menu.DebugLevel.HTTP_SERVER=HTTP_SERVER
espresso_lite_v2.menu.DebugLevel.HTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_SERVER
espresso_lite_v2.menu.DebugLevel.SSLTLS_MEM=SSL+TLS_MEM
espresso_lite_v2.menu.DebugLevel.SSLTLS_MEM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM
espresso_lite_v2.menu.DebugLevel.SSLHTTP_CLIENT=SSL+HTTP_CLIENT
espresso_lite_v2.menu.DebugLevel.SSLHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT
espresso_lite_v2.menu.DebugLevel.SSLHTTP_SERVER=SSL+HTTP_SERVER
espresso_lite_v2.menu.DebugLevel.SSLHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_SERVER
espresso_lite_v2.menu.DebugLevel.TLS_MEMHTTP_CLIENT=TLS_MEM+HTTP_CLIENT
espresso_lite_v2.menu.DebugLevel.TLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
espresso_lite_v2.menu.DebugLevel.TLS_MEMHTTP_SERVER=TLS_MEM+HTTP_SERVER
espresso_lite_v2.menu.DebugLevel.TLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
espresso_lite_v2.menu.DebugLevel.HTTP_CLIENTHTTP_SERVER=HTTP_CLIENT+HTTP_SERVER
espresso_lite_v2.menu.DebugLevel.HTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
espresso_lite_v2.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENT=SSL+TLS_MEM+HTTP_CLIENT
espresso_lite_v2.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
espresso_lite_v2.menu.DebugLevel.SSLTLS_MEMHTTP_SERVER=SSL+TLS_MEM+HTTP_SERVER
espresso_lite_v2.menu.DebugLevel.SSLTLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
espresso_lite_v2.menu.DebugLevel.SSLHTTP_CLIENTHTTP_SERVER=SSL+HTTP_CLIENT+HTTP_SERVER
espresso_lite_v2.menu.DebugLevel.SSLHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
espresso_lite_v2.menu.DebugLevel.TLS_MEMHTTP_CLIENTHTTP_SERVER=TLS_MEM+HTTP_CLIENT+HTTP_SERVER
espresso_lite_v2.menu.DebugLevel.TLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
espresso_lite_v2.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER
espresso_lite_v2.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
espresso_lite_v2.menu.DebugLevel.CORE=CORE
espresso_lite_v2.menu.DebugLevel.CORE.build.debug_level= -DDEBUG_ESP_CORE
espresso_lite_v2.menu.DebugLevel.WIFI=WIFI
espresso_lite_v2.menu.DebugLevel.WIFI.build.debug_level= -DDEBUG_ESP_WIFI
espresso_lite_v2.menu.DebugLevel.HTTP_UPDATE=HTTP_UPDATE
espresso_lite_v2.menu.DebugLevel.HTTP_UPDATE.build.debug_level= -DDEBUG_ESP_HTTP_UPDATE
espresso_lite_v2.menu.DebugLevel.UPDATER=UPDATER
espresso_lite_v2.menu.DebugLevel.UPDATER.build.debug_level= -DDEBUG_ESP_UPDATER
espresso_lite_v2.menu.DebugLevel.OTA=OTA
espresso_lite_v2.menu.DebugLevel.OTA.build.debug_level= -DDEBUG_ESP_OTA
espresso_lite_v2.menu.DebugLevel.COREWIFIHTTP_UPDATEUPDATEROTA=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA
espresso_lite_v2.menu.DebugLevel.COREWIFIHTTP_UPDATEUPDATEROTA.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA
espresso_lite_v2.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTA=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA
espresso_lite_v2.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTA.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA
espresso_lite_v2.menu.DebugLevel.NoAssert-NDEBUG=NoAssert-NDEBUG
espresso_lite_v2.menu.DebugLevel.NoAssert-NDEBUG.build.debug_level= -DNDEBUG
espresso_lite_v2.menu.UploadSpeed.115200=115200
espresso_lite_v2.menu.UploadSpeed.115200.upload.speed=115200
espresso_lite_v2.menu.UploadSpeed.9600=9600
espresso_lite_v2.menu.UploadSpeed.9600.upload.speed=9600
espresso_lite_v2.menu.UploadSpeed.57600=57600
espresso_lite_v2.menu.UploadSpeed.57600.upload.speed=57600
espresso_lite_v2.menu.UploadSpeed.230400.linux=230400
espresso_lite_v2.menu.UploadSpeed.230400.macosx=230400
espresso_lite_v2.menu.UploadSpeed.230400.upload.speed=230400
espresso_lite_v2.menu.UploadSpeed.256000.windows=256000
espresso_lite_v2.menu.UploadSpeed.256000.upload.speed=256000
espresso_lite_v2.menu.UploadSpeed.460800.linux=460800
espresso_lite_v2.menu.UploadSpeed.460800.macosx=460800
espresso_lite_v2.menu.UploadSpeed.460800.upload.speed=460800
espresso_lite_v2.menu.UploadSpeed.512000.windows=512000
espresso_lite_v2.menu.UploadSpeed.512000.upload.speed=512000
espresso_lite_v2.menu.UploadSpeed.921600=921600
espresso_lite_v2.menu.UploadSpeed.921600.upload.speed=921600

