arendst/Tasmota/arduino/version 2.4.0/boards.txt
##############################################################
wifinfo.name=WifInfo
wifinfo.menu.ESPModule.ESP12.build.board=ESP8266_ESP12
wifinfo.menu.ESPModule.ESP12.upload.maximum_size=1044464
wifinfo.menu.ESPModule.ESP12.build.spiffs_pagesize=256
wifinfo.menu.ESPModule.ESP12.build.flash_ld=eagle.flash.4m1m.ld
wifinfo.menu.ESPModule.ESP07192.build.spiffs_blocksize=4096
wifinfo.menu.ESPModule.ESP07192.build.spiffs_end=0xFB000
wifinfo.menu.ESPModule.ESP12=ESP12 (4M/1M SPIFFS)
wifinfo.menu.ESPModule.ESP12.build.spiffs_start=0x300000
wifinfo.menu.ESPModule.ESP12.build.spiffs_end=0x3FB000
wifinfo.menu.ESPModule.ESP07192.build.spiffs_start=0xCB000
wifinfo.menu.ESPModule.ESP07192.build.board=ESP8266_ESP07
wifinfo.menu.ESPModule.ESP12.build.spiffs_blocksize=8192
wifinfo.menu.ESPModule.ESP12.build.flash_size=4M
wifinfo.build.board=WIFINFO
wifinfo.build.variant=wifinfo
wifinfo.menu.ESPModule.ESP07192.build.flash_ld=eagle.flash.1m192.ld
wifinfo.menu.ESPModule.ESP07192.build.flash_size=1M
wifinfo.menu.ESPModule.ESP07192=ESP07 (1M/192K SPIFFS)
wifinfo.menu.ESPModule.ESP07192.upload.maximum_size=827376
wifinfo.upload.tool=esptool
wifinfo.upload.maximum_data_size=81920
wifinfo.upload.wait_for_upload_port=true
wifinfo.serial.disableDTR=true
wifinfo.serial.disableRTS=true
wifinfo.build.mcu=esp8266
wifinfo.build.core=esp8266
wifinfo.build.spiffs_pagesize=256
wifinfo.build.debug_port=
wifinfo.build.debug_level=
wifinfo.menu.CpuFrequency.80=80 MHz
wifinfo.menu.CpuFrequency.80.build.f_cpu=80000000L
wifinfo.menu.CpuFrequency.160=160 MHz
wifinfo.menu.CpuFrequency.160.build.f_cpu=160000000L
wifinfo.build.flash_mode=qio
wifinfo.menu.FlashFreq.40=40MHz
wifinfo.menu.FlashFreq.40.build.flash_freq=40
wifinfo.menu.FlashFreq.80=80MHz
wifinfo.menu.FlashFreq.80.build.flash_freq=80
wifinfo.menu.FlashSize.1M0=1M (no SPIFFS)
wifinfo.menu.FlashSize.1M0.build.flash_size=1M
wifinfo.menu.FlashSize.1M0.build.flash_ld=eagle.flash.1m0.ld
wifinfo.menu.FlashSize.1M0.build.spiffs_pagesize=256
wifinfo.menu.FlashSize.1M0.upload.maximum_size=1023984
wifinfo.menu.FlashSize.1M64=1M (64K SPIFFS)
wifinfo.menu.FlashSize.1M64.build.flash_size=1M
wifinfo.menu.FlashSize.1M64.build.flash_ld=eagle.flash.1m64.ld
wifinfo.menu.FlashSize.1M64.build.spiffs_pagesize=256
wifinfo.menu.FlashSize.1M64.upload.maximum_size=958448
wifinfo.menu.FlashSize.1M64.build.spiffs_start=0xEB000
wifinfo.menu.FlashSize.1M64.build.spiffs_end=0xFB000
wifinfo.menu.FlashSize.1M64.build.spiffs_blocksize=4096
wifinfo.menu.FlashSize.1M128=1M (128K SPIFFS)
wifinfo.menu.FlashSize.1M128.build.flash_size=1M
wifinfo.menu.FlashSize.1M128.build.flash_ld=eagle.flash.1m128.ld
wifinfo.menu.FlashSize.1M128.build.spiffs_pagesize=256
wifinfo.menu.FlashSize.1M128.upload.maximum_size=892912
wifinfo.menu.FlashSize.1M128.build.spiffs_start=0xDB000
wifinfo.menu.FlashSize.1M128.build.spiffs_end=0xFB000
wifinfo.menu.FlashSize.1M128.build.spiffs_blocksize=4096
wifinfo.menu.FlashSize.1M144=1M (144K SPIFFS)
wifinfo.menu.FlashSize.1M144.build.flash_size=1M
wifinfo.menu.FlashSize.1M144.build.flash_ld=eagle.flash.1m144.ld
wifinfo.menu.FlashSize.1M144.build.spiffs_pagesize=256
wifinfo.menu.FlashSize.1M144.upload.maximum_size=876528
wifinfo.menu.FlashSize.1M144.build.spiffs_start=0xD7000
wifinfo.menu.FlashSize.1M144.build.spiffs_end=0xFB000
wifinfo.menu.FlashSize.1M144.build.spiffs_blocksize=4096
wifinfo.menu.FlashSize.1M160=1M (160K SPIFFS)
wifinfo.menu.FlashSize.1M160.build.flash_size=1M
wifinfo.menu.FlashSize.1M160.build.flash_ld=eagle.flash.1m160.ld
wifinfo.menu.FlashSize.1M160.build.spiffs_pagesize=256
wifinfo.menu.FlashSize.1M160.upload.maximum_size=860144
wifinfo.menu.FlashSize.1M160.build.spiffs_start=0xD3000
wifinfo.menu.FlashSize.1M160.build.spiffs_end=0xFB000
wifinfo.menu.FlashSize.1M160.build.spiffs_blocksize=4096
wifinfo.menu.FlashSize.1M192=1M (192K SPIFFS)
wifinfo.menu.FlashSize.1M192.build.flash_size=1M
wifinfo.menu.FlashSize.1M192.build.flash_ld=eagle.flash.1m192.ld
wifinfo.menu.FlashSize.1M192.build.spiffs_pagesize=256
wifinfo.menu.FlashSize.1M192.upload.maximum_size=827376
wifinfo.menu.FlashSize.1M192.build.spiffs_start=0xCB000
wifinfo.menu.FlashSize.1M192.build.spiffs_end=0xFB000
wifinfo.menu.FlashSize.1M192.build.spiffs_blocksize=4096
wifinfo.menu.FlashSize.1M256=1M (256K SPIFFS)
wifinfo.menu.FlashSize.1M256.build.flash_size=1M
wifinfo.menu.FlashSize.1M256.build.flash_ld=eagle.flash.1m256.ld
wifinfo.menu.FlashSize.1M256.build.spiffs_pagesize=256
wifinfo.menu.FlashSize.1M256.upload.maximum_size=761840
wifinfo.menu.FlashSize.1M256.build.spiffs_start=0xBB000
wifinfo.menu.FlashSize.1M256.build.spiffs_end=0xFB000
wifinfo.menu.FlashSize.1M256.build.spiffs_blocksize=4096
wifinfo.menu.FlashSize.1M512=1M (512K SPIFFS)
wifinfo.menu.FlashSize.1M512.build.flash_size=1M
wifinfo.menu.FlashSize.1M512.build.flash_ld=eagle.flash.1m512.ld
wifinfo.menu.FlashSize.1M512.build.spiffs_pagesize=256
wifinfo.menu.FlashSize.1M512.upload.maximum_size=499696
wifinfo.menu.FlashSize.1M512.build.spiffs_start=0x7B000
wifinfo.menu.FlashSize.1M512.build.spiffs_end=0xFB000
wifinfo.menu.FlashSize.1M512.build.spiffs_blocksize=8192
wifinfo.menu.LwIPVariant.v2mss536=v2 Prebuilt (MSS=536)
wifinfo.menu.LwIPVariant.v2mss536.build.lwip_include=lwip2/include
wifinfo.menu.LwIPVariant.v2mss536.build.lwip_lib=-llwip2
wifinfo.menu.LwIPVariant.v2mss536.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536
wifinfo.menu.LwIPVariant.v2mss1460=v2 Prebuilt (MSS=1460, unstable)
wifinfo.menu.LwIPVariant.v2mss1460.build.lwip_include=lwip2/include
wifinfo.menu.LwIPVariant.v2mss1460.build.lwip_lib=-llwip2_1460
wifinfo.menu.LwIPVariant.v2mss1460.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460
wifinfo.menu.LwIPVariant.Prebuilt=v1.4 Prebuilt
wifinfo.menu.LwIPVariant.Prebuilt.build.lwip_lib=-llwip_gcc
wifinfo.menu.LwIPVariant.Prebuilt.build.lwip_flags=-DLWIP_OPEN_SRC
wifinfo.menu.LwIPVariant.OpenSource=v1.4 Open Source
wifinfo.menu.LwIPVariant.OpenSource.build.lwip_lib=-llwip_src
wifinfo.menu.LwIPVariant.OpenSource.build.lwip_flags=-DLWIP_OPEN_SRC
wifinfo.menu.LwIPVariant.OpenSource.recipe.hooks.sketch.prebuild.1.pattern=make -C "{runtime.platform.path}/tools/sdk/lwip/src" install TOOLS_PATH="{runtime.tools.xtensa-lx106-elf-gcc.path}/bin/xtensa-lx106-elf-"
wifinfo.menu.Debug.Disabled=Disabled
wifinfo.menu.Debug.Disabled.build.debug_port=
wifinfo.menu.Debug.Serial=Serial
wifinfo.menu.Debug.Serial.build.debug_port=-DDEBUG_ESP_PORT=Serial
wifinfo.menu.Debug.Serial1=Serial1
wifinfo.menu.Debug.Serial1.build.debug_port=-DDEBUG_ESP_PORT=Serial1
wifinfo.menu.DebugLevel.None____=None
wifinfo.menu.DebugLevel.None____.build.debug_level=
wifinfo.menu.DebugLevel.SSL=SSL
wifinfo.menu.DebugLevel.SSL.build.debug_level= -DDEBUG_ESP_SSL
wifinfo.menu.DebugLevel.TLS_MEM=TLS_MEM
wifinfo.menu.DebugLevel.TLS_MEM.build.debug_level= -DDEBUG_ESP_TLS_MEM
wifinfo.menu.DebugLevel.HTTP_CLIENT=HTTP_CLIENT
wifinfo.menu.DebugLevel.HTTP_CLIENT.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT
wifinfo.menu.DebugLevel.HTTP_SERVER=HTTP_SERVER
wifinfo.menu.DebugLevel.HTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_SERVER
wifinfo.menu.DebugLevel.SSLTLS_MEM=SSL+TLS_MEM
wifinfo.menu.DebugLevel.SSLTLS_MEM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM
wifinfo.menu.DebugLevel.SSLHTTP_CLIENT=SSL+HTTP_CLIENT
wifinfo.menu.DebugLevel.SSLHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT
wifinfo.menu.DebugLevel.SSLHTTP_SERVER=SSL+HTTP_SERVER
wifinfo.menu.DebugLevel.SSLHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_SERVER
wifinfo.menu.DebugLevel.TLS_MEMHTTP_CLIENT=TLS_MEM+HTTP_CLIENT
wifinfo.menu.DebugLevel.TLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
wifinfo.menu.DebugLevel.TLS_MEMHTTP_SERVER=TLS_MEM+HTTP_SERVER
wifinfo.menu.DebugLevel.TLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
wifinfo.menu.DebugLevel.HTTP_CLIENTHTTP_SERVER=HTTP_CLIENT+HTTP_SERVER
wifinfo.menu.DebugLevel.HTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
wifinfo.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENT=SSL+TLS_MEM+HTTP_CLIENT
wifinfo.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
wifinfo.menu.DebugLevel.SSLTLS_MEMHTTP_SERVER=SSL+TLS_MEM+HTTP_SERVER
wifinfo.menu.DebugLevel.SSLTLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
wifinfo.menu.DebugLevel.SSLHTTP_CLIENTHTTP_SERVER=SSL+HTTP_CLIENT+HTTP_SERVER
wifinfo.menu.DebugLevel.SSLHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
wifinfo.menu.DebugLevel.TLS_MEMHTTP_CLIENTHTTP_SERVER=TLS_MEM+HTTP_CLIENT+HTTP_SERVER
wifinfo.menu.DebugLevel.TLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
wifinfo.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER
wifinfo.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
wifinfo.menu.DebugLevel.CORE=CORE
wifinfo.menu.DebugLevel.CORE.build.debug_level= -DDEBUG_ESP_CORE
wifinfo.menu.DebugLevel.WIFI=WIFI
wifinfo.menu.DebugLevel.WIFI.build.debug_level= -DDEBUG_ESP_WIFI
wifinfo.menu.DebugLevel.HTTP_UPDATE=HTTP_UPDATE
wifinfo.menu.DebugLevel.HTTP_UPDATE.build.debug_level= -DDEBUG_ESP_HTTP_UPDATE
wifinfo.menu.DebugLevel.UPDATER=UPDATER
wifinfo.menu.DebugLevel.UPDATER.build.debug_level= -DDEBUG_ESP_UPDATER
wifinfo.menu.DebugLevel.OTA=OTA
wifinfo.menu.DebugLevel.OTA.build.debug_level= -DDEBUG_ESP_OTA
wifinfo.menu.DebugLevel.COREWIFIHTTP_UPDATEUPDATEROTA=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA
wifinfo.menu.DebugLevel.COREWIFIHTTP_UPDATEUPDATEROTA.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA
wifinfo.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTA=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA
wifinfo.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTA.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA
wifinfo.menu.DebugLevel.NoAssert-NDEBUG=NoAssert-NDEBUG
wifinfo.menu.DebugLevel.NoAssert-NDEBUG.build.debug_level= -DNDEBUG
wifinfo.menu.UploadSpeed.115200=115200
wifinfo.menu.UploadSpeed.115200.upload.speed=115200
wifinfo.menu.UploadSpeed.9600=9600
wifinfo.menu.UploadSpeed.9600.upload.speed=9600
wifinfo.menu.UploadSpeed.57600=57600
wifinfo.menu.UploadSpeed.57600.upload.speed=57600
wifinfo.menu.UploadSpeed.230400.linux=230400
wifinfo.menu.UploadSpeed.230400.macosx=230400
wifinfo.menu.UploadSpeed.230400.upload.speed=230400
wifinfo.menu.UploadSpeed.256000.windows=256000
wifinfo.menu.UploadSpeed.256000.upload.speed=256000
wifinfo.menu.UploadSpeed.460800.linux=460800
wifinfo.menu.UploadSpeed.460800.macosx=460800
wifinfo.menu.UploadSpeed.460800.upload.speed=460800
wifinfo.menu.UploadSpeed.512000.windows=512000
wifinfo.menu.UploadSpeed.512000.upload.speed=512000
wifinfo.menu.UploadSpeed.921600=921600
wifinfo.menu.UploadSpeed.921600.upload.speed=921600

