arendst/Tasmota/arduino/version 2.4.0/boards.txt
##############################################################
arduino-esp8266.name=Arduino
arduino-esp8266.menu.BoardModel.starottodeved.build.board=ESP8266_ARDUINO_STAR_OTTO
arduino-esp8266.menu.BoardModel.primo.build.extra_flags=-DF_CRYSTAL=40000000 -DESP8266
arduino-esp8266.menu.BoardModel.starottodeved.build.extra_flags=-DF_CRYSTAL=40000000 -DESP8266
arduino-esp8266.menu.BoardModel.starottodeved.build.variant=arduino_uart
arduino-esp8266.menu.BoardModel.unowifideved.build.board=ESP8266_ARDUINO_UNOWIFI
arduino-esp8266.menu.BoardModel.unowifideved.build.extra_flags=-DF_CRYSTAL=40000000 -DESP8266
arduino-esp8266.menu.BoardModel.primo=Primo
arduino-esp8266.menu.BoardModel.unowifideved.build.variant=arduino_uart
arduino-esp8266.menu.BoardModel.primo.build.variant=arduino_spi
arduino-esp8266.menu.BoardModel.starottodeved=Star OTTO
arduino-esp8266.build.board=ESP8266_ARDUINO
arduino-esp8266.menu.BoardModel.primo.build.board=ESP8266_ARDUINO_PRIMO
arduino-esp8266.menu.BoardModel.unowifideved=Uno WiFi
arduino-esp8266.upload.tool=esptool
arduino-esp8266.upload.maximum_data_size=81920
arduino-esp8266.upload.wait_for_upload_port=true
arduino-esp8266.serial.disableDTR=true
arduino-esp8266.serial.disableRTS=true
arduino-esp8266.build.mcu=esp8266
arduino-esp8266.build.core=esp8266
arduino-esp8266.build.variant=generic
arduino-esp8266.build.spiffs_pagesize=256
arduino-esp8266.build.debug_port=
arduino-esp8266.build.debug_level=
arduino-esp8266.menu.CpuFrequency.80=80 MHz
arduino-esp8266.menu.CpuFrequency.80.build.f_cpu=80000000L
arduino-esp8266.menu.CpuFrequency.160=160 MHz
arduino-esp8266.menu.CpuFrequency.160.build.f_cpu=160000000L
arduino-esp8266.build.flash_mode=qio
arduino-esp8266.build.flash_freq=40
arduino-esp8266.menu.FlashSize.4M1M=4M (1M SPIFFS)
arduino-esp8266.menu.FlashSize.4M1M.build.flash_size=4M
arduino-esp8266.menu.FlashSize.4M1M.build.flash_ld=eagle.flash.4m1m.ld
arduino-esp8266.menu.FlashSize.4M1M.build.spiffs_pagesize=256
arduino-esp8266.menu.FlashSize.4M1M.upload.maximum_size=1044464
arduino-esp8266.menu.FlashSize.4M1M.build.spiffs_start=0x300000
arduino-esp8266.menu.FlashSize.4M1M.build.spiffs_end=0x3FB000
arduino-esp8266.menu.FlashSize.4M1M.build.spiffs_blocksize=8192
arduino-esp8266.menu.FlashSize.4M3M=4M (3M SPIFFS)
arduino-esp8266.menu.FlashSize.4M3M.build.flash_size=4M
arduino-esp8266.menu.FlashSize.4M3M.build.flash_ld=eagle.flash.4m.ld
arduino-esp8266.menu.FlashSize.4M3M.build.spiffs_pagesize=256
arduino-esp8266.menu.FlashSize.4M3M.upload.maximum_size=1044464
arduino-esp8266.menu.FlashSize.4M3M.build.spiffs_start=0x100000
arduino-esp8266.menu.FlashSize.4M3M.build.spiffs_end=0x3FB000
arduino-esp8266.menu.FlashSize.4M3M.build.spiffs_blocksize=8192
arduino-esp8266.menu.LwIPVariant.v2mss536=v2 Prebuilt (MSS=536)
arduino-esp8266.menu.LwIPVariant.v2mss536.build.lwip_include=lwip2/include
arduino-esp8266.menu.LwIPVariant.v2mss536.build.lwip_lib=-llwip2
arduino-esp8266.menu.LwIPVariant.v2mss536.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536
arduino-esp8266.menu.LwIPVariant.v2mss1460=v2 Prebuilt (MSS=1460, unstable)
arduino-esp8266.menu.LwIPVariant.v2mss1460.build.lwip_include=lwip2/include
arduino-esp8266.menu.LwIPVariant.v2mss1460.build.lwip_lib=-llwip2_1460
arduino-esp8266.menu.LwIPVariant.v2mss1460.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460
arduino-esp8266.menu.LwIPVariant.Prebuilt=v1.4 Prebuilt
arduino-esp8266.menu.LwIPVariant.Prebuilt.build.lwip_lib=-llwip_gcc
arduino-esp8266.menu.LwIPVariant.Prebuilt.build.lwip_flags=-DLWIP_OPEN_SRC
arduino-esp8266.menu.LwIPVariant.OpenSource=v1.4 Open Source
arduino-esp8266.menu.LwIPVariant.OpenSource.build.lwip_lib=-llwip_src
arduino-esp8266.menu.LwIPVariant.OpenSource.build.lwip_flags=-DLWIP_OPEN_SRC
arduino-esp8266.menu.LwIPVariant.OpenSource.recipe.hooks.sketch.prebuild.1.pattern=make -C "{runtime.platform.path}/tools/sdk/lwip/src" install TOOLS_PATH="{runtime.tools.xtensa-lx106-elf-gcc.path}/bin/xtensa-lx106-elf-"
arduino-esp8266.menu.Debug.Disabled=Disabled
arduino-esp8266.menu.Debug.Disabled.build.debug_port=
arduino-esp8266.menu.Debug.Serial=Serial
arduino-esp8266.menu.Debug.Serial.build.debug_port=-DDEBUG_ESP_PORT=Serial
arduino-esp8266.menu.Debug.Serial1=Serial1
arduino-esp8266.menu.Debug.Serial1.build.debug_port=-DDEBUG_ESP_PORT=Serial1
arduino-esp8266.menu.DebugLevel.None____=None
arduino-esp8266.menu.DebugLevel.None____.build.debug_level=
arduino-esp8266.menu.DebugLevel.SSL=SSL
arduino-esp8266.menu.DebugLevel.SSL.build.debug_level= -DDEBUG_ESP_SSL
arduino-esp8266.menu.DebugLevel.TLS_MEM=TLS_MEM
arduino-esp8266.menu.DebugLevel.TLS_MEM.build.debug_level= -DDEBUG_ESP_TLS_MEM
arduino-esp8266.menu.DebugLevel.HTTP_CLIENT=HTTP_CLIENT
arduino-esp8266.menu.DebugLevel.HTTP_CLIENT.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT
arduino-esp8266.menu.DebugLevel.HTTP_SERVER=HTTP_SERVER
arduino-esp8266.menu.DebugLevel.HTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_SERVER
arduino-esp8266.menu.DebugLevel.SSLTLS_MEM=SSL+TLS_MEM
arduino-esp8266.menu.DebugLevel.SSLTLS_MEM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM
arduino-esp8266.menu.DebugLevel.SSLHTTP_CLIENT=SSL+HTTP_CLIENT
arduino-esp8266.menu.DebugLevel.SSLHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT
arduino-esp8266.menu.DebugLevel.SSLHTTP_SERVER=SSL+HTTP_SERVER
arduino-esp8266.menu.DebugLevel.SSLHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_SERVER
arduino-esp8266.menu.DebugLevel.TLS_MEMHTTP_CLIENT=TLS_MEM+HTTP_CLIENT
arduino-esp8266.menu.DebugLevel.TLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
arduino-esp8266.menu.DebugLevel.TLS_MEMHTTP_SERVER=TLS_MEM+HTTP_SERVER
arduino-esp8266.menu.DebugLevel.TLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
arduino-esp8266.menu.DebugLevel.HTTP_CLIENTHTTP_SERVER=HTTP_CLIENT+HTTP_SERVER
arduino-esp8266.menu.DebugLevel.HTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
arduino-esp8266.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENT=SSL+TLS_MEM+HTTP_CLIENT
arduino-esp8266.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
arduino-esp8266.menu.DebugLevel.SSLTLS_MEMHTTP_SERVER=SSL+TLS_MEM+HTTP_SERVER
arduino-esp8266.menu.DebugLevel.SSLTLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
arduino-esp8266.menu.DebugLevel.SSLHTTP_CLIENTHTTP_SERVER=SSL+HTTP_CLIENT+HTTP_SERVER
arduino-esp8266.menu.DebugLevel.SSLHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
arduino-esp8266.menu.DebugLevel.TLS_MEMHTTP_CLIENTHTTP_SERVER=TLS_MEM+HTTP_CLIENT+HTTP_SERVER
arduino-esp8266.menu.DebugLevel.TLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
arduino-esp8266.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER
arduino-esp8266.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
arduino-esp8266.menu.DebugLevel.CORE=CORE
arduino-esp8266.menu.DebugLevel.CORE.build.debug_level= -DDEBUG_ESP_CORE
arduino-esp8266.menu.DebugLevel.WIFI=WIFI
arduino-esp8266.menu.DebugLevel.WIFI.build.debug_level= -DDEBUG_ESP_WIFI
arduino-esp8266.menu.DebugLevel.HTTP_UPDATE=HTTP_UPDATE
arduino-esp8266.menu.DebugLevel.HTTP_UPDATE.build.debug_level= -DDEBUG_ESP_HTTP_UPDATE
arduino-esp8266.menu.DebugLevel.UPDATER=UPDATER
arduino-esp8266.menu.DebugLevel.UPDATER.build.debug_level= -DDEBUG_ESP_UPDATER
arduino-esp8266.menu.DebugLevel.OTA=OTA
arduino-esp8266.menu.DebugLevel.OTA.build.debug_level= -DDEBUG_ESP_OTA
arduino-esp8266.menu.DebugLevel.COREWIFIHTTP_UPDATEUPDATEROTA=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA
arduino-esp8266.menu.DebugLevel.COREWIFIHTTP_UPDATEUPDATEROTA.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA
arduino-esp8266.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTA=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA
arduino-esp8266.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTA.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA
arduino-esp8266.menu.DebugLevel.NoAssert-NDEBUG=NoAssert-NDEBUG
arduino-esp8266.menu.DebugLevel.NoAssert-NDEBUG.build.debug_level= -DNDEBUG
arduino-esp8266.menu.UploadSpeed.115200=115200
arduino-esp8266.menu.UploadSpeed.115200.upload.speed=115200
arduino-esp8266.menu.UploadSpeed.9600=9600
arduino-esp8266.menu.UploadSpeed.9600.upload.speed=9600
arduino-esp8266.menu.UploadSpeed.57600=57600
arduino-esp8266.menu.UploadSpeed.57600.upload.speed=57600
arduino-esp8266.menu.UploadSpeed.230400.linux=230400
arduino-esp8266.menu.UploadSpeed.230400.macosx=230400
arduino-esp8266.menu.UploadSpeed.230400.upload.speed=230400
arduino-esp8266.menu.UploadSpeed.256000.windows=256000
arduino-esp8266.menu.UploadSpeed.256000.upload.speed=256000
arduino-esp8266.menu.UploadSpeed.460800.linux=460800
arduino-esp8266.menu.UploadSpeed.460800.macosx=460800
arduino-esp8266.menu.UploadSpeed.460800.upload.speed=460800
arduino-esp8266.menu.UploadSpeed.512000.windows=512000
arduino-esp8266.menu.UploadSpeed.512000.upload.speed=512000
arduino-esp8266.menu.UploadSpeed.921600=921600
arduino-esp8266.menu.UploadSpeed.921600.upload.speed=921600

